// 4. Напишите программу, которая принимает на вход число и проверяет, 
//кратно ли оно одновременно 7 и 23.

int N = 14;
if (N % 7 == 0 && N % 23 == 0)
{
    Console.WriteLine("yes");
}
else
{
    Console.WriteLine("no");
};
